<h1><center>Titanic: Machine Learning with Disaster (Novice level)</center></h1>

I am new to Data Science and would like to take this competition as my stepping stone to be better at Data Science!

**Contents**:
1. Problem Statement
2. Import Necessary Libraries
3. Collecting Data
4. Data Analysis
5. Data Visualization
6. Cleaning Data
7. Choosing the Best Model
8. Creating Submission File

<h3>1.  Problem Statement </h3>

<p style="text-align:justify">The task is to complete the analysis of what sorts of people were likely to survive, using the tools of machine learning to predict which passengers survived the tragedy.</p>

<h3>2. Import Necessary Libraries</h3>

Import libraries required to solve the problem

In [17]:
#Data analysis libraries
import numpy as np
import pandas as pd

#Data visualization libraries
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

<h3>3. Collecting Data</h3>

In [18]:
#Data can be collected from Kaggle (https://www.kaggle.com/c/titanic/data)

#Import train and test CSV
train = pd.read_csv("/Users/xunister/Desktop/Data Science/Titanic/Titanic Data/train.csv")
test = pd.read_csv("/Users/xunister/Desktop/Data Science/Titanic/Titanic Data/test.csv")

#An initial look at the training data set
train.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Davies, Mr. Charles Henry",male,NaN,NaN,NaN,CA. 2343,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

<h3>4. Data Analysis </h3>

In [19]:
#A look at the list of features in the training data set

print(train.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [20]:
#A look at the type of features in the training data sert

train.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
494,495,0,3,"Stanley, Mr. Edward Roland",male,21.0,0,0,A/4 45380,8.0500,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
495,496,0,3,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
809,810,1,1,"Chambers, Mrs. Norman Campbell (Bertha Griggs)",female,33.0,1,0,113806,53.1000,E8,S
478,479,0,3,"Karlsson, Mr. Nils August",male,22.0,0,0,350060,7.5208,NaN,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
178,179,0,2,"Hale, Mr. Reginald",male,30.0,0,0,250653,13.0000,NaN,S

 - **Numerical Features**: Age (Continuous), Fare (Continuous), SipSp (Discrete), Parch (Discrete)
 - **Categorical Features**: Survived, Sex, Embarked, Pclass
 - **Alphanumeric Features**: Ticket, Cabin
 
 
 **Age**: Float  
 **Fare**: Float  
 **SipSp**: Integer  
 **Parch**: Integer  
 **Survived**: Integer  
 **Sex**: String  
 **Embarked**: String  
 **Pclass**: Integer  
 **Ticket**: String  
 **Cabin**: String  
 **Name**: String  
 **PassengerId**: Integer

**Observation of the data**:  
There are a total of 891 passengers in Titanic.  
The Age column is missing of 177 values, approximately 19.8% of the total dataset.  
The Cabin column is missing of 687 values, approximately 77.1% of the total dataset.  
The Embarked column is missing of 2 values, approximately 0.2% of the total datast.  

As there is a huge number of missing values under Cabin column, we may disregard this column for our analysis.  

We will attempt to fill up the missing values of Age column as age seems to be an important factor.

In [21]:
#Include the rest of the missing values with the median age.

train['Age'] = train['Age'].fillna(train['Age'].median())

train.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,891.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Davies, Mr. Charles Henry",male,NaN,NaN,NaN,CA. 2343,NaN,G6,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.361582,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,13.019697,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,22.000000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,35.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [22]:
#Check for any unusable data columns

print(pd.isnull(train).sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

It can be seen that other than Cabin and Embarked features, there are no Nan values.  
We have filled up the NaN values of Age feature with the median age.